---
kind: method
id: M:Autodesk.Revit.DB.SubTransaction.Dispose
source: html/ea153fdd-ccdc-41ca-3233-cfa661ccd164.htm
---
# Autodesk.Revit.DB.SubTransaction.Dispose Method

Releases all resources used by the SubTransaction

## Syntax (C#)
```csharp
public void Dispose()
```